In [2]:
import pandas as pd

In [3]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [4]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [5]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [6]:
df1.shape # Getting shape

(7, 3)

In [7]:
df1.info() #Getting info about row and columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [8]:
df1.isnull().sum() # Looking for if there is null.

Name      0
Marks     0
Gender    0
dtype: int64

In [12]:
df1.describe(include="all").T # Describe fundemantal aggregation terms of the dataFrame.

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Name,7,7,Priyang,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marks,7.0,NaN,NaN,NaN,92.142857,6.491753,83.0,88.0,90.0,98.5,99.0
Gender,7,2,Female,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [18]:
df1['Gender'].nunique()

2

In [19]:
df1['Gender'].value_counts() # Find number of unique values one by one.

Female    4
Male      3
Name: Gender, dtype: int64

In [26]:
df1['Marks'].between(90, 100).sum() #Find number of grades between 90 and 100

4

In [38]:
len(df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)]) # Same thing with using Fancy.

4

In [40]:
df1['Marks'].mean() # Calculating mean of Marks

92.14285714285714

In [42]:
df1['Marks'].min() # Min of Marks.

83

In [43]:
df1['Marks'].max() #Max of Marks

99

In [44]:
df1["Marks"].std()

6.491753010001007

<h4> Apply Method </h4>

In [46]:
def marks(x):
    return x/2

df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [48]:
df1['Marks'].apply(lambda x: x/2) # Using lambda in apply.

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

<h4> Map Function </h4>

In [52]:
a = df1['Gender'].map({'Male': 1, 'Female': 0}) # Changing Gender values to 0 and 1 (String value to Int).

In [55]:
df1['Male_Female'] = a
df1 # Adding new Column

      Name  Marks  Gender  Male_Female
0  Priyang     98    Male            1
1   Aadhya     89  Female            0
2   Krisha     99  Female            0
3   Vedant     87    Male            1
4   Parshv     90    Male            1
5   Mittal     83  Female            0
6  Archana     99  Female            0

In [56]:
df1.drop('Male_Female', axis = 1, inplace=True) # Dropping a col permanent.

In [57]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [60]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [62]:
df1.sort_values(by = 'Marks', ascending = False) # Sorting Values

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [74]:
df1.sort_values(by = 'Gender')[['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99
0  Priyang     98
3   Vedant     87
4   Parshv     90

<h4> Displaying female students name and grades </h4>

In [84]:
df1[df1['Gender'] == 'Female'].drop('Gender', axis=1)

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [85]:
df1[df1['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [87]:
df1[df1['Gender'].isin(['Female'])][['Marks', 'Name']]

   Marks     Name
1     89   Aadhya
2     99   Krisha
5     83   Mittal
6     99  Archana